# Still needed:
# exa
# open in
# open-vpn / open-vpn connect; https://formulae.brew.sh/formula/openvpn#default ?
# twitter
# adspower browser
# wifi-man
# samsung portable SSD
# onepassword for safari
# raindrop for safari
# bank2qfx
# quicken / quicken-beta
# folder tidy
# readdle documents
# menubar stats
# NextDNS
# protonmail beta
# pibar
# spacemesh
# spotify
# vscode - insiders
# proton-mail - beta
# bitwarden
# logitech-unifying
# wireguard-go
# yubikey-personalization
# yubkikey-manager

# Consider:
# cask 'helo' # e-mail debugger for developers
# brew swiftdefaultappsprefpane
# crypto-pro
# brew "git-gui"
# brew 'imagemagick'
# brew 'wget'
# brew "duti"
# brew "openssl@3"

# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'carthage'
brew 'cocoapods'
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'lsd'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pass'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'solana'
brew 'svn' # Needed to install 
brew 'tree'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'zsh-completions'

# Dev Apps
cask 'charles'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'pgadmin4'
cask 'pycharm'
cask 'redisinsight'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'warp'

# Development
brew 'heroku/brew/heroku'
brew 'gettext'
brew 'just'
brew 'lazygit'
brew 'mysql'
brew 'poetry'
brew 'postgresql@15'
brew 'pyenv'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
# cask '1password'
cask '1password-cli'
cask 'arc'
cask 'bartender'
cask 'brave-browser'
cask 'caffeine'
cask 'cardhop'
cask 'daisydisk'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'insomnia' # api test 
cask 'ledger-live'
cask 'logi-options-plus'
cask 'marginnote'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'microsoft-powerpoint'
cask 'notion'
cask 'obsidian'
cask 'onedrive'
cask 'pastebot'
cask 'pdf-expert'
cask 'proton-drive'
cask 'protonmail-bridge'
cask 'protonvpn'
cask 'raindropio'
cask 'readdle-spark'
cask 'rectangle'
cask 'synology-drive'
cask 'tableplus' # gui tool for relational databases
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'todoist'
cask 'transmit'
cask 'tuple'
cask 'whatsapp'
cask 'ykpers' # yubikey-personalization
cask 'yubico-yubikey-manager'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas 'Drafts', id: 1435957248
mas 'HP Smart', id: 1474276998
mas 'NextDNS', id: 1464122853
mas 'Raivo OTP', id: 1498497896
mas 'zClock', id: 1478540997